In [2]:
data = {
    'id':['1','2','3','4','5'],
    'student':['A','B','C','D','E'],
    'subject1':[90,85,87,60,80],
    'subject2':[98,90,75,55,88],
    'subject3':[80,70,90,70,80],
}

 

## (i) add total score as new column ,
# (ii) add percentage column by lambda function,
# (iii) find highest scoring student

In [39]:
dataframe

  id student  subject1  subject2  subject3  total_sum  percentage
0  1       A        90        98        80        268    0.893333
1  2       B        85        90        70        245    0.816667
2  3       C        87        75        90        252    0.840000
3  4       D        60        55        70        185    0.616667
4  5       E        80        88        80        248    0.826667

  id student  subject1  subject2  subject3  total_sum  percentage
0  1       A        90        98        80        268    0.893333

In [22]:
(dataframe.iloc[:1,2:]).values

array([[90, 98, 80]], dtype=int64)

In [26]:
import numpy as np
np.sum(dataframe.iloc[:,2:],axis=1)

0    268
1    245
2    252
3    185
4    248
dtype: int64

In [27]:
np.sum(dataframe,axis=1)

C:\Users\abhishek\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:84: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return reduction(axis=axis, out=out, **passkwargs)

0    268
1    245
2    252
3    185
4    248
dtype: int64

In [43]:
data = {
    'id':['1','2','3','4','5','6',None],
    'amt':['1245000','1245000','500000','955000','955000','1500000',None],
    'TRNDT':["09-Aug","09-Aug","09-Aug","10-Aug","10-Aug","10-Aug",None]
}
dataframe=pd.DataFrame(data)

In [44]:
dataframe

  id      amt   TRNDT
0  1  1245000  09-Aug
1  2  1245000  09-Aug
2  3   500000  09-Aug
3  4   955000  10-Aug
4  5   955000  10-Aug
5  6  1500000  10-Aug

In [50]:
dataframe.groupby(["TRNDT"]).max('amt')

Empty DataFrame
Columns: []
Index: [09-Aug, 10-Aug]

In [ ]:
#find null values
#remove the columns in null value> 70%

In [75]:
dataframedata = {
    'id':['1','2','3','4','5','6',None],
    'amt':['1245000','1245000','500000','955000','955000','1500000',None],
    'TRNDT':["09-Aug","09-Aug","09-Aug","10-Aug","10-Aug","10-Aug",None],
    "nullbased":[None for i in range(7)]
}
dataframe=pd.DataFrame(dataframedata)

In [76]:
dataframe

     id      amt   TRNDT nullbased
0     1  1245000  09-Aug      None
1     2  1245000  09-Aug      None
2     3   500000  09-Aug      None
3     4   955000  10-Aug      None
4     5   955000  10-Aug      None
5     6  1500000  10-Aug      None
6  None     None    None      None

In [88]:
# dataframe["amt"].plot()
empl:
    id:
    name:
    deptId:
    salary:

SyntaxError: invalid syntax (2947619650.py, line 2)

In [ ]:
select *
from empl
where id not in (select id, from empl group by deptId,id order by salary desc)


select max(salary)
from empl
where id not in (select max(salary) from empl group )



select * 
from empl as e1
where 2=(select count(*) from empl as e2 where e1.salary<>e2.salary)

r score

In [ ]:
with cte as (
select id,name,deptId,salary, dense_rank() over(partition by deptId order by salary desc) as salary_rank
from empl
)
select * from cte
where salary_rank=2

In [77]:
shape=dataframe.shape[0]
percent_shape=0.7*shape
dropping_col=[]
for col in list(dataframe.columns):
    new_df=dataframe[col][dataframe[col].isna()==True]
    print(new_df)
    if new_df.shape[0]>percent_shape:
        print(col)
        dropping_col.append(col)

dataframe.drop(dropping_col,inplace=True,axis=1)

6    None
Name: id, dtype: object
6    None
Name: amt, dtype: object
6    None
Name: TRNDT, dtype: object
0    None
1    None
2    None
3    None
4    None
5    None
6    None
Name: nullbased, dtype: object
nullbased

     id      amt   TRNDT
0     1  1245000  09-Aug
1     2  1245000  09-Aug
2     3   500000  09-Aug
3     4   955000  10-Aug
4     5   955000  10-Aug
5     6  1500000  10-Aug
6  None     None    None

In [84]:
dropping_col

['nullbased']